Примечание:
Оформляйте ввод и вывод данных в соответствии с примерами заданий. Используйте только то, что было пройденно до этого урока включительно. Задания выполняйте при помощи цикла while. Не используйте в условии оператор in.


Задание 16.1
Напишите программу, которая запрашивает с консоли два числа - начало и конец диапазона. Программа должна вывести в консоль в порядке убывания все числа, которые нацело делятся на 11 в указанном диапазоне.
ПРИМЕР
ВВОД:
Введите начало диапазона: 1
Введите конец диапазона: 32

ВЫВОД:
Числа диапазона [1, 32], которые делятся на 11:
22
11
1


Задание 16.2
Teston Lebra написал программу, которая получает данные от пользователя и преобразует эти данные в хэш-код (число). Если в этих данных содержатся ошибки, то цифра 5 будет встречается в числе больше трёх раз. Напишите программу, которая запрашивает с консоли число и проверяет количество цифр 5. Если количество пятёрок больше трёх, то программа должна вывести в консоль "В данных пользователя присутствуют ошибки.". В противном случае программа должна вывести в консоль "Данные пользователя в порядке.".
ПРИМЕР
ВВОД:
Введите хэш-код (число): 283073481295386363459721836860

ВЫВОД:
Данные пользователя в порядке.


Задание 16.3
Напишите программу, которая позволяет выбрать пользователю вид такси, запрашивает с консоли расстояние и выводит в консоль стоимость поездки.
ПРИМЕР
1. Эконом класс (0.3 за 1 км.)
2. Комфорт класс (0.6 за 1 км.)
3. Бизнес класс (0.8 за 1 км.)
4. Завершить программу
Выберите действие: 2
===============================
Введите расстояние (км.): 20
Стоимость поездки: 12
===============================
1. Эконом класс (0.3 за 1 км.)
2. Комфорт класс (0.6 за 1 км.)
3. Бизнес класс (0.8 за 1 км.)
4. Завершить программу
Выберите действие: 4
===============================
Завершение программы.


Задание 16.4
Напишите программу, которая позволяет пользователю добавить товар в корзину и оплатить эту корзину. Считайте, что изначально у пользователя 1000 денег.
ПРИМЕР
Ваш текущий баланс: 1000
1. Оплатить корзину
2. Добавить товар в корзину
3. Завершить программу
Выберите действие: 2
============================
Список товаров:
1. Хлеб - 20
2. Молоко - 80
3. Яйца - 5
Выберите товар: 1
Введите количество: 5
============================
Ваш текущий баланс: 1000
1. Оплатить корзину
2. Добавить товар в корзину
3. Завершить программу
Выберите действие: 1
============================
Товары оплачены.
Ваш текущий баланс: 900
1. Оплатить корзину
2. Добавить товар в корзину
3. Завершить программу
Выберите действие: 3
============================
Завершение программы. 


Задание 16.5
В магазине "Всё Не Дорого" вышло обновление, в котором теперь не нужно вводить итоговую стоимость товара, а достаточно указать стоимость товара и его количество, а программа сама сделает подсчёты итоговой стоимости. Напишите программу, которая запрашивает с консоли сперва стоимость, а затем количество. Так до тех пор, пока пользователь просто не нажмёт клавишу "Enter" во время ввода стоимости или количества. Затем программа выводит в консоль итоговую стоимость.
ПРИМЕР
ВВОД:
Введите стоимость товара: 100
Введите количество данного товара: 5
Введите стоимость товара: 13
Введите количество данного товара: 10
Введите стоимость товара: 5
Введите количество данного товара: 20
Введите стоимость товара: 

ВЫВОД:
Итоговая стоимость: 730


Задание 16.6
В магазине "Всё Не Дорого" стартовала акция на доставку. Если сумму заказа перевернуть и получится та же самая сумма (число палиндром), то выдаётся купон в 10% на следующую покупку. Напишите программу, которая запрашивает с консоли итоговую сумму и выводит в консоль "Выдаётся 10% купон.", если сумма является палиндромом. В противном случае выводится "Купон не выдаётся.".
Подсказка: Вам нужно сделать копию числа и перевернуть его. Затем сравнивать исходное число и перевёрнутое.

ПРИМЕР
ВВОД:
Введите итоговую сумму: 232

ВЫВОД:
Выдаётся 10% купон.


Задание 16.7
Teston Lebra попросили доказать на практике, что шансы выпадения чисел 1, 2, 3, 4, 5 и 6 на игральной кости около 16.6%. Напишите программу, которая доказывает это при помощи симуляции.
ПОДСКАЗКИ:
1. Программа не требует ввода пользователя.

2. Используйте следующий код, чтобы генерировать числа от 1 до 6 включительно:
from random import randint  # Подключение модуля random и импорт функции randint

number = randint(1, 6)  # Генерация случайного четырёхзначного числа

3. Для решения задания вам понадобится 6 переменных, в которых будут хранится количество выпадений чисел 1, 2, 3, 4, 5, 6, одна переменная для того, чтобы подсчитывать шаги цикла, одна переменная для хранения случайного числа и одна переменная для того, чтобы хранить количество бросков.

4. Генерируйте числа внутри цикла при помощи randint(1, 6). Достаточно 1000000 бросков.

5. Чтобы найти процент выпадения чисел, нужно количество выпадений числа поделить на количество бросков и умножить на 100. Например, если бросков 1000000 и количество выпадания числа 1 равно 166173, то получаем:
166173 / 1000000 * 100 = 16.6173%


Задание 16.8
Teston Lebra написал программу, которая запрашивает с консоли номер карты и выводит в консоль "Номер карты состоит только из чётных цифр." или "В номере карты присутствуют нечётные цифры." в зависимости от номера. Однако программа работает некорректно. Исправьте программу так, чтобы она работала верно, и рядом напишите комментарии о том, почему изменённый вариант должен работать верно.
КОД:
card_num = int(input("Введите номер карты: "))
is_only_even = True

while card_num >= 0:
    digit = card_num % 10
    if digit % 2 != 0:
        is_only_even = False
        continue
    else:
        is_only_even = True

print()
if is_only_even:
    print("Номер карты состоит только из чётных цифр.")
else:
    print("В номере карты присутствуют нечётные цифры.")

ПРИМЕР
ВВОД:
Введите номер карты: 5869586958695869

ВЫВОД:
В номере карты присутствуют нечётные цифры.