# ==============================================LESSON07==============================================
# print()
# Variables - int, float, bool, str
# Literal - данные в себе
# camelCase and underscore_notation
# input()
# Приведение типов
import datetime

# print()  # Вывод в консоль пустой строки

# print("Text")  # Вывод в консоль текста

# print("Some", "Text", "HELLO", "WORLD")  # Вывод в консоль нескольких аргументов через пробел

# print("Some\nText")  # \n - спецсимвол новой строки

# print("Some\tText")  # \t - спецсимвол табуляции

# print("Some\n\tText")

# print('"Some quotes"')  # Кавычки могут быть двойными или одинарными

# print("Some", "big", "text", sep="*", end="!!!")  # sep - разделитель аргументов, end - конечный текст

# ====================================================================================================
# ПЗ 7.1 - 7.3
# ====================================================================================================

# obj_int = 25
# obj_float = 25.2
# obj_bool = True
# obj_str = "Text"
# print(type(obj_int), type(obj_float), type(obj_bool), type(obj_str))  # Вывод типов переменных


# number = 15
# print(number)  # Вывод в консоль значение переменной


# num_1 = 10
# num_2 = 20
# num_3 = 30
# print(num_1, num_2, num_3)  # Вывод в консоль нескольких значений через пробел
# print(num_1, num_2, num_3, sep="*", end="!!!")


# text = input()


# name = input("Please, input your name: ")
# print("Your name is " + name)
# age = input("Please, input your age: ")
# print(type(name), type(age))


# some_str = "5"
# obj_int = int(some_str)
# obj_float = float(some_str)
# obj_bool = bool(some_str)
# obj_str = str(obj_int)
# print(obj_int, obj_float, obj_bool, obj_str, sep='\t\t\t\t')
# print(type(obj_int), type(obj_float), type(obj_bool), type(obj_str))


# ====================================================================================================
# ПЗ 7.4
# ====================================================================================================

# ==============================================LESSON08==============================================
# Операнды и Операторы + - * / % // **
# Проведение операций над переменными
# Приоритеты выполнения операций
# Бинарные и унарные операторы + и -
# Особенности при работе с плавающей точкой


# num_1 = 95
# num_2 = 10
# num_sum = num_1 + num_2
# num_dif = num_1 - num_2
# num_prod = num_1 * num_2
#
# num_div_1 = num_1 / num_2
# num_div_2 = num_1 % num_2
# num_div_3 = num_1 // num_2
#
# print(num_sum, num_dif, num_prod, num_div_1, num_div_2, num_div_3, sep="\t\t")


# num_pow = 2 ** 8
# print(num_pow)


# print(10 + 2 * 100 / 5 % 10)
# print(17 // 3 ** 2)
# print(9 % 6 % 2)
# print(2 ** 2 ** 3)


# some_num = 0.1 + 0.2
# print(some_num)
#
# epsilon = 1e-9  # 1 * 10 ** (-9) = 0.000000001
# print(abs(0.3 - some_num) < epsilon)

# ====================================================================================================
# ПЗ 8.1 - 8.7
# ====================================================================================================

# ==============================================LESSON09==============================================
# Решение задач. Разбор тонкостей и ошибок
# Сокращённые формы записи


# num_1 = "5"
# num_2 = 10
# print(num_1 + num_2)
# print(num_1 * num_2)


# num_1 = 10
# num_2 = num_1
# num_2 = 15
# print(num_1, num_2, sep='\t\t\t\t')


# number = 100
#
# 1
# number = number + 10
# print(number)
#
# 2
# number += 10
# print(number)


# Нахождение суммы путём повторения блоков кода и использование короткой записи.
# num_1 = 0
# num_2 = 10
# num_1 += num_2
# num_1 += num_2
# num_1 += num_2
# num_1 += num_2
# print(num_1)


# ====================================================================================================
# ПЗ 9.1 - 9.11
# ====================================================================================================
