Примечание:
Оформляйте ввод и вывод данных в соответствии с примерами заданий. Используйте только то, что было пройденно до этого урока включительно. Не используйте в условии оператор in. Не используйте готовые методы, только если в заданиях не говорится об использовании тех или иных методах. Не используйте срезы.

Задание 24.1
Напишите программу, которая запрашивает с консоли строку, затем переводит все заглавные английские буквы в строчные и выводит результат в консоль.
ПРИМЕР
ВВОД:
Введите строку: SoMe TeXT

ВЫВОД:
Строка маленькими буквами: some text


Задание 24.2
Напишите программу, которая запрашивает с консоли строку и выводит в консоль количество слов в строке. Словом является набор символов разделённые пробелами.
ПРИМЕР
ВВОД:
abc abc     abc

ВЫВОД:
Всего слов: 3


Задание 24.3
Напишите программу, которая запрашивает с консоли строку и выводит в консоль "В строке содержатся английские буквы" или "В строке отсутствуют английские буквы" в зависимости от строки.
ПРИМЕР
ВВОД:
Введите строку: 12345abc

ВЫВОД:
В строке содержатся английские буквы


Задание 24.4
Напишите программу, которая запрашивает с консоли строку и выводит в консоль "Строка является палиндромом" или "Строка не является палиндромом" в зависимости от строки.
Палиндром — слово или текст, которое читается одинаково слева направо и справа налево.
ПРИМЕР
ВВОД:
Введите строку: А роза упала на лапу Азора

ВЫВОД:
Строка является палиндромом


Задание 24.5
Напишите программу, которая запрашивает с консоли строку текста на английском, преобразует каждое предложение в тексте так, чтобы оно начиналось с большой буквы, и выводит результат в консоль.
ПОДСКАЗКИ
1. Создайте булевую переменную, по которой можно будет определить, нужно ли менять текущую букву на заглавную.
2. Используйте алгоритм, который был рассмотрен на уроке, где заглавные буквы нужно было заменить на строчные.

ПРИМЕР
ВВОД:
Введите строку текста: abc. def? ghi! jkl.

ВЫВОД:
Преобразованный текст: Abc. Def? Ghi! Jkl.


Задание 24.6
Напишите программу, которая запрашивает с консоли строку и выводит в консоль "В строке присутствуют только английские буквы" или "В строке присутствуют не только английские буквы" в зависимости от строки.
ПРИМЕР
ВВОД:
Введите строку: abc5de

ВЫВОД:
В строке присутствуют не только английские буквы


Задание 24.7
Teston Lebra написал программу, которая ищет последовательность символов в строке и заменяет их на другую последовательность. Однако она работает некорректно. Исправьте программу так, чтобы она работала верно, и рядом напишите комментарии о том, почему изменённый вариант должен работать верно.
КОД:
text = input("Введите строку: ")
to_find = input("Введите искомую строку: ")
to_change = input("Введите строку изменения: ")
len_text = len(text)
len_find = len(to_find)
result = ""

i = 0
while i < len_text:
    is_find = False
    j = 0
    while j < len_find:
        if text[i + j] == to_find[j]:
            is_find = True
            break
        j += 1
    if is_find:
        result += to_change
        i += len_find
    else:
        result += text[i]
        i += 1

print(f"Изменённая строка: {result}")


ПРИМЕР
ВВОД:
Введите строку: "abcabcdabc abcd"
Введите искомую строку: "abcd"
Введите строку изменения: "xx"

ВЫВОД:
Изменённая строка: abcxxabc xx