# ==============================================LESSON15==============================================
# while
# Бесконечный цикл


# ====================================================================================================
# ПЗ 15.1 - 15.2
# ====================================================================================================

# num = 0
# while True:
#     print(num)
#     num += 1

# ====================================================================================================
# ПЗ 15.3 - 15.7
# ====================================================================================================


# ==============================================LESSON16==============================================
# Управляющие операторы continue, break, else

# ====================================================================================================
# ПЗ 16.1 - 16.4
# ====================================================================================================

# ====================================================================================================
# ПЗ 16.5 - 16.8
# ====================================================================================================

# ====================================================================================================


# ==============================================LESSON17==============================================
# for in collection
# for in range()

# for symbol in "Some text":
#     print(symbol)

# text = input("Введите текст: ")
# for symb in text:
#     print(symb)

# for elem in [11, 43, 22, 89, 67, 59, 74, 20, 30]:
#     if elem % 2 == 0:
#         print(elem, end=" ")


# for i in range(10):
#     print(i, end=" ")
# print()
#
# for i in range(0, 10):
#     print(i, end=" ")
# print()
#
# for i in range(0, 10, 1):
#     print(i, end=" ")
# print()


# ====================================================================================================
# ПЗ 17.1 - 17.7
# ====================================================================================================

# ==============================================LESSON18==============================================
# Вложенные циклы


# rows = 3
# cols = 4
#
# i = 0
# while i < rows:
#     j = 0
#     while j < cols:
#         print(i, j, sep="", end=" ")
#         j += 1
#     print(i, j, sep="")
#     i += 1


# rows = 3
# cols = 4
#
# for i in range(rows):
#     for j in range(cols):
#         print(i, j, sep="", end=" ")
#     print(i, cols, sep="")


# while True:
#     print("1. Найти первое число, которое нацело делится на 7")
#     print("2. Найти первое простое число в диапазоне")
#     print("3. Завершить программу")
#     choice = input("Введите выбор: ")
#     if choice == "1":
#         print("================================================")
#         num = int(input("Введите число: "))
#         found_num = num
#         while True:
#             if found_num % 7 == 0:
#                 print("Первое число после ", num, ", которое нацело делится на 7 это число ", found_num, sep="")
#                 break
#             found_num += 1
#         print("================================================")
#     elif choice == "2":
#         print("================================================")
#         num_begin = int(input("Введите начало диапазона: "))
#         num_end = int(input("Введите конец диапазона: "))
#         temp = num_begin
#         found_num = 0
#         if num_begin == 1 or num_begin == 2:
#             found_num = num_begin
#         elif num_begin % 2 == 0:
#             num_begin += 1
#         for num in range(num_begin, num_end + 1, 2):
#             is_prime = True
#             for divider in range(3, num, 2):
#                 if num % divider == 0:
#                     is_prime = False
#                     break
#             if is_prime:
#                 found_num = num
#                 break
#         if found_num != 0:
#             num_begin = temp
#             print("Первое простое число из диапазона [", num_begin, ", ", num_end, "] это число ", found_num, sep="")
#         else:
#             print("Простое число не найдено")
#         print("================================================")
#     else:
#         print("Завершение программы")
#         break

# ====================================================================================================
# ПЗ 18.1 - 18.7
# ====================================================================================================


# ============================================LESSON19-20=============================================
# Разбор задач.
# Консольное меню.

# ====================================================================================================
# ПЗ 19.1
# ====================================================================================================

